README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>README</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="README"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-10-02T09:55+0300"/>
<meta name="author" content="Oleg Sivokon"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">README</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Original Text of the Assignment</a>
<ul>
<li><a href="#sec-1-1">1.1 <code>Walla!</code> Backend Engineers Test Assignment</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 General Guidelines:</a></li>
<li><a href="#sec-1-1-2">1.1.2 The Test Assignment:</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 What Needs to Be Done</a>
<ul>
<li><a href="#sec-2-1">2.1 Install and test Tornado</a></li>
<li><a href="#sec-2-2">2.2 Make sure MySQL binding is up-to-date</a></li>
<li><a href="#sec-2-3">2.3 Maybe try <code>py2neo</code></a></li>
<li><a href="#sec-2-4">2.4 Figure out what Apache httpd module to use</a></li>
<li><a href="#sec-2-5">2.5 Brush up on Tweeter Bootstrap</a></li>
<li><a href="#sec-2-6">2.6 Find out what most people use for unit testing</a></li>
<li><a href="#sec-2-7">2.7 Ropemacs was giving me headache lately</a></li>
<li><a href="#sec-2-8">2.8 Start a GitHub repo (and fix the setup)</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Project Description</a>
<ul>
<li><a href="#sec-3-1">3.1 Nodes and relations I will need</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Original Text of the Assignment</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> <code>Walla!</code> Backend Engineers Test Assignment</h3>
<div class="outline-text-3" id="text-1-1">


<p>   
   Heya,
   In order to evaluate your skills as a backend Web engineer, we
   would like you to take this short development assignment, at your
   own free time.
</p>

</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> General Guidelines:</h4>
<div class="outline-text-4" id="text-1-1-1">

<ol>
<li>Please provide
<ul>
<li>working code.
</li>
<li>a brief design document explaining what you did.
</li>
<li>a link to a server where your code can be tested.

</li>
</ul>

</li>
<li>Feel free to search the Web for inspiration, but please do not
       copy code from anywhere, keep it 100% yours.

</li>
<li>Use Python as your language of implementation. Micro​ Frameworks
       and utility libraries are allowed, but not a full blown MVC.
</li>
</ol>


</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> The Test Assignment:</h4>
<div class="outline-text-4" id="text-1-1-2">

<p>    You are to design and implement the API and server side modules
    for a simplified twitter like social updates site, and a simple
    AJAX client for it. The application contains users; Each user can
    post short text messages, follow other users, and get a feed of
    the latest updates from the users he is following. You can also
    get a global feed for all the users.
</p>
<ol>
<li>Implement an HTTP based (ReSTful in the loose sense of the
       term) API that exposes the following calls (no need for
       authentication, choose the format you like):
<ul>
<li><code>CreateUser(UserName)</code>
</li>
<li><code>PostMessage(UserId, MessageText)</code>
</li>
<li><code>Follow(FollowingUser, FollowedUser)</code>
</li>
<li><code>Unfollow(FollwingUser, UnfollowedUser)</code>
</li>
<li><code>GetFeed(ForUserId)</code> <i>Note the aggregate feed of the users</i>
         <i>this user is following!</i>
</li>
<li><code>GetGlobalFeed()</code>
</li>
</ul>

</li>
<li>Please create an ajax based HTML page for this API:
<ul>
<li>Interface ​
         It should support getting the messages from the followed
         users per user Id, with real time updates, and the ability to
         post messages. You do not need to implement
         following/unfollowing. No styling required.
</li>
<li>Implementation
         Use of toolkits (jQuery, Zepto, bootstrap..) is fine, but no
         frameworks plz (Angular, Backbone..). No need for mobile
         adaption. Strive for efficiency and readability.
</li>
</ul>

</li>
</ol>


<p>         
    Good Luck!
    The Walla! Backend Engineering Team
</p>
</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What Needs to Be Done</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <span class="done DONE">DONE</span> Install and test Tornado &nbsp;&nbsp;&nbsp;<span class="tag"><span class="setup">setup</span></span></h3>
<div class="outline-text-3" id="text-2-1">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-10-01 Tue</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2013-10-02 Wed 08:20</span></span> <br/>
     This was the easy part.
</li>
</ul>

<p>   Was suggested during the interview
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <span class="done CANCELED">CANCELED</span> Make sure MySQL binding is up-to-date &nbsp;&nbsp;&nbsp;<span class="tag"><span class="setup">setup</span>&nbsp;<span class="alternatives">alternatives</span></span></h3>
<div class="outline-text-3" id="text-2-2">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-10-01 Tue</span></span><br/>
</p><ul>
<li>State "CANCELED"   from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2013-10-02 Wed 08:21</span></span> <br/>
     I'll be using <code>neo4j</code>, that's decided.
</li>
</ul>

<p>   I have some vague memories of it being problematic to install,
   perhaps it required <code>mysql-devel</code> package? Can <code>setuptools</code>
   install RPM / DEB?
</p>
</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <span class="done DONE">DONE</span> Maybe try <code>py2neo</code> &nbsp;&nbsp;&nbsp;<span class="tag"><span class="setup">setup</span>&nbsp;<span class="alternatives">alternatives</span></span></h3>
<div class="outline-text-3" id="text-2-3">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-10-02 Wed</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2013-10-02 Wed 08:21</span></span> <br/>
     Yup.
</li>
</ul>

<p>   Just for the sake of experiment? There are couple of videos to
   watch. If I can get it to run easily, I'd probably use that.
</p>
</div>

</div>

<div id="outline-container-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> Figure out what Apache httpd module to use &nbsp;&nbsp;&nbsp;<span class="tag"><span class="setup">setup</span>&nbsp;<span class="info">info</span></span></h3>
<div class="outline-text-3" id="text-2-4">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-10-01 Tue</span></span><br/>
   There is some controversy about <code>WSGI</code> / <code>FSGI</code> / <code>mode_python</code>
   Need to make sure I'm not using some outdated / unsupported
   library.
</p>
</div>

</div>

<div id="outline-container-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> <span class="todo TODO">TODO</span> Brush up on Tweeter Bootstrap &nbsp;&nbsp;&nbsp;<span class="tag"><span class="setup">setup</span>&nbsp;<span class="info">info</span></span></h3>
<div class="outline-text-3" id="text-2-5">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-10-01 Tue</span></span><br/>
   This is most likely candidate for the GUI. Need to see what
   components are already there, and what's missing (unlikely).
</p>
</div>

</div>

<div id="outline-container-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> <span class="todo TODO">TODO</span> Find out what most people use for unit testing &nbsp;&nbsp;&nbsp;<span class="tag"><span class="setup">setup</span>&nbsp;<span class="info">info</span></span></h3>
<div class="outline-text-3" id="text-2-6">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-10-02 Wed</span></span><br/>
   We'll see what Stackoverflow has to say&hellip;
</p>
</div>

</div>

<div id="outline-container-2-7" class="outline-3">
<h3 id="sec-2-7"><span class="section-number-3">2.7</span> <span class="todo TODO">TODO</span> Ropemacs was giving me headache lately &nbsp;&nbsp;&nbsp;<span class="tag"><span class="setup">setup</span></span></h3>
<div class="outline-text-3" id="text-2-7">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-10-02 Wed</span></span><br/>
   See if the stupid thing still works. Maybe we shall do w/o it.
   There was some other package&hellip; Probably elpy or some such,
   maybe it makes sense to check it out.
</p>
</div>

</div>

<div id="outline-container-2-8" class="outline-3">
<h3 id="sec-2-8"><span class="section-number-3">2.8</span> <span class="done DONE">DONE</span> Start a GitHub repo (and fix the setup) &nbsp;&nbsp;&nbsp;<span class="tag"><span class="setup">setup</span></span></h3>
<div class="outline-text-3" id="text-2-8">

<p>    <span class="timestamp-wrapper"><span class="timestamp-kwd">DEADLINE: </span> <span class="timestamp">2013-10-02 Wed</span></span><br/>
</p><ul>
<li>State "DONE"       from "TODO" <span class="timestamp-wrapper"> <span class="timestamp">2013-10-02 Wed 08:21</span></span> <br/>
     Looks like it also can now display Org files markup, so no need to
     export to Markdown
</li>
</ul>

<p>   Not today.
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Project Description</h2>
<div class="outline-text-2" id="text-3">

<p>  Right now I'm thinking about making it into a <a href="http://en.wikipedia.org/wiki/Nomic">nomic</a> game.  The basic
  idea would be that by posting users may, in general, score
  points. More so, if someone comments on their posts, or if they
  themselves comment. But it would be also possible to loose points
  due to bad posts or comments. Sort of karma, just like there is one
  on the StackExchange sites.
</p>
<p>
  I'm definitely going with <code>py2neo</code>, especially because it uses
  <code>tornado</code>. It's not as efficient as SQL (at the moment), but who
  cares?
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Nodes and relations I will need</h3>
<div class="outline-text-3" id="text-3-1">


<p>   
   Nodes
</p><ul>
<li><code>User#{ "id": int, "name": string, "password": string }</code>
</li>
<li><code>Message#{ "id": int, "text" : string, "score": int }</code>
</li>
</ul>


<p>   
   Relations
</p><ul>
<li>\(user \; \boldsymbol{Follows} \; user\)
</li>
<li>\(user \; \boldsymbol{FollowedBy} \; user\)
</li>
<li>\(message \; \boldsymbol{PostedBy} \; user\)
</li>
<li>\(user \; \boldsymbol{AuthorOf} \; message\)
</li>
<li>\(user \; \boldsymbol{Rates(points)} \; message\)
</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-10-02T09:55+0300</p>
<p class="author">Author: Oleg Sivokon</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
